Show / Hide Table of Contents
Interface IProgressCallback
Namespace: IdeaStatiCa.Plugin
Assembly: IdeaStatiCa.Plugin.dll
Syntax
[ServiceContract]
public interface IProgressCallback
Methods
Improve this Doc   View Source
ExceptionMessage(String, String)
Method is called when an exception occurs on the server.
Declaration
[OperationContract(IsOneWay = true)]
void ExceptionMessage(string function, string message)
Parameters
 Type |  Name |  Description
 System.String |  function
Name of the method.
 System.String |  message
Details of the exception
Improve this Doc   View Source
IterationMessage(Double, String, String)
infomation about progress of event.
Declaration
[OperationContract(IsOneWay = true)]
void IterationMessage(double percent, string message, string iteration)
Parameters
 Type |  Name |  Description
 System.Double |  percent
percentage of event status
 System.String |  message
message
 System.String |  iteration
Number of the iteration (FEM solver steps)
Improve this Doc   View Source
ProgressMessage(Double, String)
infomation about progress of event.
Declaration
[OperationContract(IsOneWay = true)]
void ProgressMessage(double percent, string message)
Parameters
 Type |  Name |  Description
 System.Double |  percent
percentage of event status
 System.String |  message
message
 Improve this Doc
 View Source